app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R', 'NC-17') ORDER BY release_date
---
  def index
    @all_ratings = Movie.get_all_ratings
    @release_date_header_class = ''
    @title_header_class = ''
    unless params[:sort].nil?
      @selected_ratings = Movie.get_all_ratings
      @movies = Movie.order(params[:sort])
      instance_eval %Q"@#{params[:sort]}_header_class = 'hilite'"
    else
      @selected_ratings = params[:ratings] ? params[:ratings].keys : Movie.get_all_ratings
      @movies = Movie.where(rating: @selected_ratings)